import pandas as pd

movies = pd.DataFrame({
    'Название': ['Аватар', 'Титаник', 'Мстители', 'Джокер', 'Барби'],
    'Год': [2009, 1997, 2012, 2019, 2023],
    'Бюджет_млн': [237, 200, 220, 55, 145],
    'Сборы_млн': [2847, 2200, 1518, 1074, 1445],
    'Рейтинг': [7.9, 7.9, 8.0, 8.8, 7.0]
})

movies['не провальность'] = movies['Сборы_млн'] - movies['Бюджет_млн']
print(movies.loc[movies['не провальность'].idxmax()])

print(movies.loc[movies['Рейтинг'].idxmax()])

print(movies['Бюджет_млн'].mean())

print(movies[(movies['Год'] > 2010) & (movies['Рейтинг'] > 7.5)])
